emacs_configuration.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Initial Setting

This is a list of things that might not work out of the bxo and that might require some manual work. It is probably possible to make this something that runs after fresh install.

The following is important to fix viz stuff (e.g., xft.dpi fix font for gtk apps; usually i have problems when attaching a monitor)

#+begin_src

vinid@jester:~/opt/pycharm$ cat ../../.xinitrc
export _JAVA_AWT_WM_NONREPARENTING=1

vinid@jester:~/opt/pycharm$ cat ../../.Xresources 
Xft.dpi: 125
Xcursor*theme: whiteglass
Xcursor*size: 32

  
#+end_src

** Packages to Install Before

There is a buch of additional packages I need to install before being able to run exwm (e.g., emacs). Makes
sense to install this packages when there's a new fresh install.

- compton
- slock
- xss-lock
- dunst for notifications
- fonts-firacode
- fonts-cantarell
- arandr

  Hopefully the following command install most things

#+begin_src
    sudo apt install emacs git fonts-firacode fonts-cantarell compton slock xss-lock arandr dunst
#+end_src

+ note that dropbox requires also to install the mini module to run commands (dropbox-nautilus?)
  
To see the icons one as also to run ;; M-x all-the-icons-install-fonts




** Setup

*** Tmux

This entire configuration comes form https://hamvocke.com/blog/a-guide-to-customizing-your-tmux-conf/

#+begin_src shell :tangle ~/.tmux.conf

unbind C-b
set-option -g prefix C-f
bind-key C-f send-prefix

bind i split-window -h
bind o split-window -v
unbind '"'
unbind %

# DESIGN TWEAKS: https://hamvocke.com/blog/a-guide-to-customizing-your-tmux-conf/

# don't do anything when a 'bell' rings
set -g visual-activity off
set -g visual-bell off
set -g visual-silence off
setw -g monitor-activity off
set -g bell-action none

# clock mode
setw -g clock-mode-colour colour1

# copy mode
setw -g mode-style 'fg=colour1 bg=colour18 bold'

# pane borders
set -g pane-border-style 'fg=colour1'
set -g pane-active-border-style 'fg=colour3'

# statusbar
set -g status-position bottom
set -g status-justify left
set -g status-style 'fg=colour1'
set -g status-left ''
set -g status-right '%Y-%m-%d %H:%M '
set -g status-right-length 50
set -g status-left-length 10

setw -g window-status-current-style 'fg=colour0 bg=colour1 bold'
setw -g window-status-current-format ' #I #W #F '

setw -g window-status-style 'fg=colour1 dim'
setw -g window-status-format ' #I #[fg=colour7]#W #[fg=colour1]#F '

setw -g window-status-bell-style 'fg=colour2 bg=colour1 bold'

# messages
set -g message-style 'fg=colour2 bg=colour0 bold'

#+end_src

*** Main Emacs

This symbolic link is used to connect the local desktop configuration with the one under the /xsession/ folder.

#+begin_src sh :tangle no

  sudo ln -f ~/.emacs.d/exwm/EXWM.desktop /usr/share/xsessions/EXWM.desktop
#+end_src

  Desktop entry for EXWM, runs the bash script

#+begin_src shell :tangle ./exwm/EXWM.desktop :mkdirp yes
  [Desktop Entry]
  Name=EXWM
  Comment=Emacs Window Manager
  Exec=sh /home/vinid/.emacs.d/exwm/start-exwm.sh
  TryExec=sh
  Type=Application
#+end_src

Bash script that initialize EXWM


** Installing stuff

*** Straight.el

Straight is used to install packages

#+begin_src emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

#+end_src


** Backend processes

#+begin_src  shell :tangle ./exwm/start-exwm.sh :shebang #!/bin/sh :mkdirp yes

  # Run the screen compositor
  compton &

  # Enable screen locking on suspend
  xss-lock -- slock &

  # Fire it up
  exec dbus-launch --exit-with-session emacs -mm --debug-init  

#+end_src


* Actual Start of Emacs Configuration

#+BEGIN_SRC emacs-lisp

  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (setq inhibit-startup-screen t)
  (setq visible-bell t)

  ;; Remap CapsLock to Ctrl
  ;; TODO need to add the remapping to be tangle
  (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")


#+END_SRC

** Desktop Setup

A thing to keep in mind is that I had to set manually the dpi for xorg

#+begin_src emacs-lisp

   (defvar vinid/default-font-size 140)
   (defvar vinid/default-variable-font-size 140)

   (set-face-attribute 'default nil :font "Fira Code Retina" :height vinid/default-font-size)

   ;; Set the fixed pitch face
   (set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height vinid/default-font-size)

   ;; Set the variable pitch face
   (set-face-attribute 'variable-pitch nil :font "Cantarell" :height vinid/default-variable-font-size :weight 'regular)

   (use-package all-the-icons)

   (ido-mode 1)

   (global-display-line-numbers-mode t)

  

   (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
   (add-to-list 'default-frame-alist '(fullscreen . maximized))

   ;; Disable line numbers for some modes
   (dolist (mode '(org-mode-hook
                   term-mode-hook
                   shell-mode-hook
                   treemacs-mode-hook
                   eshell-mode-hook))
     (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src


* Other Emacs Packages

This part of the configuration includes basic stuff needed to have a working emacs environment

** Ivy

#+begin_src emacs-lisp

  (use-package ivy
      :diminish
      :bind (("C-s" . swiper)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)
             ("C-l" . ivy-alt-done)
             ("C-j" . ivy-next-line)
             ("C-k" . ivy-previous-line)
             :map ivy-switch-buffer-map
             ("C-k" . ivy-previous-line)
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1))

    (use-package ivy-rich
      :after ivy
      :init
      (ivy-rich-mode 1))

  (use-package counsel
      :bind (("C-M-j" . 'counsel-switch-buffer)
             :map minibuffer-local-map
             ("C-r" . 'counsel-minibuffer-history))
      :custom
      (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
      :config

  (counsel-mode 1))

#+end_src

#+begin_src emacs-lisp 

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src


#+begin_src emacs-lisp

;; NOTE: If you want to move everything out of the ~/.emacs.d folder
;; reliably, set `user-emacs-directory` before loading no-littering!
;(setq user-emacs-directory "~/.cache/emacs")

(use-package no-littering)

;; no-littering doesn't set this by default so we must place
;; auto save files in the same path as it uses for sessions
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src


** Dired

#+begin_src emacs-lisp

  (use-package dired
    :straight nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first")))

  (use-package dired-single)

                                          ; to avoid creating infinite buffers with dired. I am not sure if this is working or not

  (defun my-dired-init ()
    "Bunch of stuff to run for dired, either immediately or when it's
         loaded."
    ;; <add other stuff here>
    (define-key dired-mode-map [remap dired-find-file]
      'dired-single-buffer)
    (define-key dired-mode-map [remap dired-mouse-find-file-other-window]
      'dired-single-buffer-mouse)
    (define-key dired-mode-map [remap dired-up-directory]
      'dired-single-up-directory))

  ;; if dired's already loaded, then the keymap will be bound
  (if (boundp 'dired-mode-map)
      ;; we're good to go; just add our bindings
      (my-dired-init)
    ;; it's not loaded yet, so add our bindings to the load-hook
    (add-hook 'dired-load-hook 'my-dired-init))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

                                          ;  (use-package dired-hide-dotfiles
                                          ;   :hook (dired-mode . dired-hide-dotfiles-mode)
                                          ;  :config
                                          ; (bind-key   "H" 'dired-hide-dotfiles-mode))

#+end_src

** GPG setup

Not sure why, but without this GPG takes a long time to call the prompt for the passwords (seems to be a known bug).

Second option is for the gpg cache timeout

#+begin_src shell :tangle ~/.gnupg/gpg-agent.conf :makdirp yes
default-cache-ttl 86400      # cache for a day
max-cache-ttl 86400
no-allow-external-cache
#+end_src

