emacs_configuration.org
** EXWM Basic Setup

All the configuration params currently used in EXWM.

#+begin_src emacs-lisp
  (server-start)

  (setq mouse-autoselect-window t
        focus-follows-mouse t)

  (defun vinid/exwm-init-hook ()
    ;; Make workspace 1 be the one where we land at startup
    (exwm-workspace-switch-create 1))

  (defun vinid/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))
  ;; defines a function that makes a nicer visualization for the firefox tab
  (defun vinid/exwm-update-title ()
    (pcase exwm-class-name
      ("Firefox" (exwm-workspace-rename-buffer (format "Firefox: %s" exwm-title)))))

  (defun vinid/set-wallpaper ()
    (interactive)
    ;; NOTE: You will need to update this to a valid background path!
    (start-process-shell-command
     "feh" nil  "feh --bg-scale /home/vinid/Pictures/wall.jpg"))

  (use-package exwm
    :config
    ;; Set the default number of workspaces
    (setq exwm-workspace-number 5)

    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'vinid/exwm-update-class)

    ;; When EXWM starts up, do some extra configuration
    (add-hook 'exwm-init-hook #'vinid/exwm-init-hook)

    (setq mouse-autoselect-window nil
          focus-follows-mouse nil)

    ;; When window title updates, use it to set the buffer name

    (add-hook 'exwm-update-title-hook #'vinid/exwm-update-title)
    ;; To add a key binding only available in line-mode, simply define it in
    ;; `exwm-mode-map'.  The following example shortens 'C-c q' to 'C-q'.
    (define-key exwm-mode-map [?\C-q] #'exwm-input-send-next-key)

    ;; adding a way to run apps
    (exwm-input-set-key (kbd "\C-c SPC") 'counsel-linux-app) 

    ;; (counsel-linux-app)
    ;; toggle fullscreen
    (exwm-input-set-key (kbd "s-f") 'exwm-layout-toggle-fullscreen)

    ;; Set the wallpaper after changing the resolution
    (vinid/set-wallpaper)

    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\C-u
            ?\C-h
            ?\M-x
            ?\M-`
            ?\M-&
            ?\M-:
            ?\C-\M-j  ;; Buffer list
            ?\C-\ ))  ;; Ctrl+Space


    ;; Ctrl+Q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; The following example demonstrates how to use simulation keys to mimic
    ;; the behavior of Emacs.  The value of `exwm-input-simulation-keys` is a
    ;; list of cons cells (SRC . DEST), where SRC is the key sequence you press
    ;; and DEST is what EXWM actually sends to application.  Note that both SRC
    ;; and DEST should be key sequences (vector or string).
    (setq exwm-input-simulation-keys
          '(
            ;; movement
            ([?\C-b] . [left])
            ([?\M-b] . [C-left])
            ([?\C-f] . [right])
            ([?\M-f] . [C-right])
            ([?\C-p] . [up])
            ([?\C-n] . [down])
            ([?\C-a] . [home])
            ([?\C-e] . [end])
            ([?\M-v] . [prior])
            ([?\C-h] . [left delete])
            ([?\C-v] . [next])
            ([?\C-d] . [delete])
            ([?\M-d] . [C-S-right delete])
            ([?\C-k] . [S-end delete])
            ;; cut paste
            ([?\C-w] . [?\C-x])
            ([?\M-w] . [?\C-c])
            ([?\C-y] . [?\C-v])
            ;; search
            ([?\C-s] . [?\C-f])))


    ;; raise the specified app if it's already started, otherwise start it
    ;; this should ideally raise buffer the previous buffer, not the current one
    ;; meaning: if I had chrome on the right side and I call this from the left side
    ;;          it should show up on the right side

    (defun vinid/run-or-raise (buffer-prefix &optional cmd)
      (let ((existing-buffer
             (cl-dolist (buffer (buffer-list))
               (if (string-prefix-p buffer-prefix (buffer-name buffer))
                   (cl-return buffer)))))
        (if existing-buffer
            ;; it's currently displayed, go to it
            (if (get-buffer-window existing-buffer)
                (message (format "%s" (pop-to-buffer existing-buffer)))
              (exwm-workspace-switch-to-buffer existing-buffer))
          (start-process-shell-command buffer-prefix nil cmd))))


    ;; Set up global key bindings.  These always work, no matter the input state!
    ;; Keep in mind that changing this list after EXWM initializes has no effect.
    (setq exwm-input-global-keys
          `(
            ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
            ([?\s-r] . exwm-reset)

            ;; Move between windows
            ([s-left] . windmove-left)
            ([s-right] . windmove-right)
            ([s-up] . windmove-up)
            ([s-down] . windmove-down)

            ;; Launch applications via shell command
            ([?\s-&] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; Switch workspace
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

            ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))

    (exwm-enable))
  
#+end_src


