emacs_configuration.org
** Polybar

Polybar serves as the main bar on the top of the screen


#+begin_src shell :tangle /home/vinid/.config/polybar/config :mkdirp yes

  ; Docs: https://github.com/polybar/polybar
  ;==========================================================
  [settings]
  screenchange-reload = true

  [global/wm]
  margin-top = 0
  margin-bottom = 0

  [colors]
  background = #f0232635
  background-alt = #576075
  foreground = #A6Accd
  foreground-alt = #555
  primary = #ffb52a
  secondary = #e60053
  alert = #bd2c40
  underline-1 = #c792ea


  [bar/panel]
  dpi = 250

  [bar/panel]
  width = 100%
  height = 55
  offset-x = 0
  offset-y = 0
  fixed-center = true
  enable-ipc = true

  background = ${colors.background}
  foreground = ${colors.foreground}

  line-size = 2
  line-color = #f00

  border-size = 0
  border-color = #00000000

  padding-top = 5
  padding-left = 1
  padding-right = 1

  module-margin = 1

  font-0 = "Cantarell:size=12:weight=bold;2"
  font-1 = "Font Awesome:size=12;2"
  font-2 = "Material Icons:size=16;5"
  font-3 = "Fira Mono:size=11;-3"

  modules-left = exwm-workspace vpn
  modules-right = cpu memory temperature battery date

  tray-position = right
  tray-padding = 2
  tray-maxsize = 28

  cursor-click = pointer
  cursor-scroll = ns-resize

  [module/exwm-workspace]
  type = custom/ipc
  hook-0 = emacsclient -e "exwm-workspace-current-index" | sed -e 's/^"//' -e 's/"$//'
  initial = 1
  format-padding = 1

  [module/cpu]
  type = internal/cpu
  interval = 2
  format = <label> <ramp-coreload>
  click-left = emacsclient -e "(proced)"
  label = %percentage:2%%
  ramp-coreload-spacing = 0
  ramp-coreload-0 = ▁
  ramp-coreload-0-foreground = ${colors.foreground-alt}
  ramp-coreload-1 = ▂
  ramp-coreload-2 = ▃
  ramp-coreload-3 = ▄
  ramp-coreload-4 = ▅
  ramp-coreload-5 = ▆
  ramp-coreload-6 = ▇

  [module/date]
  type = internal/date
  interval = 5

  date = "%a %b %e"
  date-alt = "%A %B %d %Y"

  time = %l:%M %p
  time-alt = %H:%M:%S

  format-prefix-foreground = ${colors.foreground-alt}


  label = %date% %time%

  [module/battery]
  type = internal/battery
  battery = BAT0
  adapter = ADP1
  full-at = 98
  time-format = %-l:%M

  label-charging = %percentage%% / %time%
  format-charging = <animation-charging> <label-charging>


  label-discharging = %percentage%% / %time%
  format-discharging = <ramp-capacity> <label-discharging>
  format-full = <ramp-capacity> <label-full>

  ramp-capacity-0 = 
  ramp-capacity-1 = 
  ramp-capacity-2 = 
  ramp-capacity-3 = 
  ramp-capacity-4 = 

  animation-charging-0 = 
  animation-charging-1 = 
  animation-charging-2 = 
  animation-charging-3 = 
  animation-charging-4 = 
  animation-charging-framerate = 750

  [module/memory]
  type = internal/memory
  interval = 5
  format-prefix = " "
  label = %gb_used%

  [module/temperature]
  type = internal/temperature
  thermal-zone = 0
  warn-temperature = 60

  format = <label>
  format-warn = <label-warn>
  format-warn-underline = ${self.format-underline}

  label = %temperature-c%
  label-warn = %temperature-c%!
  label-warn-foreground = ${colors.secondary}

  [module/vpn]
  type = custom/script
  exec = echo "VPN: " $(nordvpn status | sed -n 's/Status: \([[:alpha:]]\).*/\1/p' | tr -d '[:punct:]')
  interval = 10
  format-underline = #268bd2
  #  format-prefix = "🖧 "
  format-prefix-foreground = #5b
  
#+end_src

Very simple polybar to have on top of the EXWM desktop environment

#+begin_src emacs-lisp
    
    (defvar vinid/polybar-process nil
      "Holds the process of the running Polybar instance, if any")
    
    (defun vinid/kill-panel ()
      (interactive)
      (when vinid/polybar-process
        (ignore-errors
          (kill-process vinid/polybar-process)))
      (setq vinid/polybar-process nil))
    
    (defun vinid/start-panel ()
      (interactive)
      (vinid/kill-panel)
      (setq vinid/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))
    
    (defun vinid/send-polybar-hook (module-name hook-index)
      (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))
    
    (defun vinid/send-polybar-exwm-workspace ()
      (vinid/send-polybar-hook "exwm-workspace" 1))
    
    ;; Update panel indicator when workspace changes
    (add-hook 'exwm-workspace-switch-hook #'vinid/send-polybar-exwm-workspace)
    (vinid/start-panel)
    
    (setq exwm-workspace-number 4)
    
    (setq exwm-manage-force-tiling nil)
    
    ;; Automatically move EXWM buffer to current workspace when selected
  (setq exwm-layout-show-all-buffers t)
  
  ;; Display all EXWM buffers in every workspace buffer list
  (setq exwm-workspace-show-all-buffers t)
    
#+end_src




** Configuration for the multiple screens

(skipping this for now)

#
  (require 'exwm-randr)

  (exwm-randr-enable)
  
  (setq exwm-randr-workspace-monitor-plist '(2 "DP-2"))

  (setq exwm-workspace-warp-cursor t)


  (defun vinid/update-displays ()
    (vinid/run-in-background "autorandr --change --force")
                                          ;    (message "Display config: %s"
    (string-trim (shell-command-to-string "autorandr --current")))

  (add-hook 'exwm-randr-screen-change-hook #'vinid/update-displays)
  (vinid/update-displays)



#+end_src


* Apps

** Run in background function

This function allows to run a process in the background

#+begin_src emacs-lisp

  (defun vinid/run-in-background (command)
     (let ((command-parts (split-string command "[ ]+")))
       (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

#+end_src

** Dropbox

#+begin_src emacs-lisp

(vinid/run-in-background "dropbox start")

#+end_src

** Quick access to some of the files

#+begin_src emacs-lisp


  (defun vinid/emacs-configuration ()
    (interactive)
    (find-file "~/.emacs.d/emacs_configuration.org"))

  (defun vinid/open-todolist ()
    (interactive)
    (find-file "~/Dropbox/org/orgmode/todos.org"))

 (defun vinid/open-inbox ()
    (interactive)
    (find-file "~/Dropbox/org/orgmode/inbox.org"))


#+end_src

** Miscellanea Keybindings


Cleaning unused buffers

#+begin_src emacs-lisp

   (setq clean-buffer-list-delay-special (* 1 3600))
   (setq clean-buffer-list-delay-general 1)
   (global-set-key (kbd "C-c e b") 'clean-buffer-list)

#+end_src

#+begin_src emacs-lisp
  
  (global-set-key (kbd "M-?") 'help-command)
  (global-set-key (kbd "C-h") 'delete-backward-char)

  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c e c") 'vinid/emacs-configuration)
  (global-set-key (kbd "C-c e t") 'vinid/open-todolist)
  (global-set-key (kbd "C-c e i") 'vinid/open-inbox)
#+end_src


** 1passel


1passel is a very simple utility I have built to manage 1password integration withing EXWM

#+begin_src emacs-lisp
    
    (use-package 1passel
      :straight '(1passel :host github
                                     :repo "vinid/1passel"
                                     :branch "master"))
    
#+end_src

** GPT custom

#+begin_src emacs-lisp

  (defun gpt-improve()
    (interactive)
      (kill-new (shell-command-to-string
               (concat "python3 /home/vinid/nope/gptask.py --string '" (current-kill 0) "'"))))

    (global-set-key (kbd "C-c g") 'gpt-improve)

#+end_src


** QuteBrowser



#+begin_src shell :tangle /home/vinid/.config/qutebrowser/qutemacs.py :mkdirp yes

   # qutemacs - a simple, preconfigured Emacs binding set for # qutebrowser
   #
   # The aim of this binding set is not to provide bindings for absolutely
   # everything, but to provide a stable launching point for people to make their
   # own bindings.
   #
   # Installation:
   #
   # 1. Copy this file or add this repo as a submodule to your dotfiles.
   # 2. Add this line to your config.py, and point the path to this file:
   # config.source('qutemacs/qutemacs.py')


   config = config  # type: ConfigAPI # noqa: F821 pylint:
   # disable=E0602,C0103
   c = c  # type: ConfigContainer # noqa: F821 pylint: disable=E0602,C0103

   # disable insert mode completely
   c.input.insert_mode.auto_enter = False
   c.input.insert_mode.auto_leave = False
   c.input.insert_mode.plugins = False

   # Forward unbound keys
   c.input.forward_unbound_keys = "all"

   ESC_BIND = 'clear-keychain ;; search ;; fullscreen --leave'


   c.bindings.default['normal'] = {}
   c.bindings.default['insert'] = {}
   # Bindings
   c.bindings.commands['normal'] = {
           # Navigation
           '<ctrl-v>': 'scroll-page 0 0.5',
           '<alt-v>': 'scroll-page 0 -0.5',
           '<ctrl-shift-v>': 'scroll-page 0 1',
           '<alt-shift-v>': 'scroll-page 0 -1',
           # FIXME come up with logical bindings for scrolling left/right

           # Commands
           '<ctrl-ù>': 'set-cmd-text :',
   #	'<ctrl-x>b': 'set-cmd-text -s :buffer',
           '<ctrl-t>k': 'tab-close',
   #	'<ctrl-x><ctrl-c>': 'quit',



           # searching
           '<ctrl-s>': 'set-cmd-text /',
           '<ctrl-r>': 'set-cmd-text ?',

           # hinting
           '<alt-s>': 'hint all',

           # history
           '<ctrl-k>': 'forward',
           '<ctrl-j>': 'back',

           # tabs
           '<ctrl-tab>': 'tab-next',
           '<ctrl-shift-tab>': 'tab-prev',

           # open links
           '<ctrl-l>': 'set-cmd-text -s :open',
           '<alt-l>': 'set-cmd-text -s :open -t',

           # editing
           '<ctrl-f>': 'fake-key <Right>',
           '<ctrl-b>': 'fake-key <Left>',
           '<ctrl-a>': 'fake-key <Home>',
           '<ctrl-e>': 'fake-key <End>',
           '<ctrl-n>': 'fake-key <Down>',
           '<ctrl-p>': 'fake-key <Up>',
           '<alt-f>': 'fake-key <Ctrl-Right>',
           '<alt-b>': 'fake-key <Ctrl-Left>',
           '<ctrl-d>': 'fake-key <Delete>',
           '<alt-d>': 'fake-key <Ctrl-Delete>',
           '<alt-backspace>': 'fake-key <Ctrl-Backspace>',


           # Numbers
           # https://github.com/qutebrowser/qutebrowser/issues/4213
           '1': 'fake-key 1',
           '2': 'fake-key 2',
           '3': 'fake-key 3',
           '4': 'fake-key 4',
           '5': 'fake-key 5',
           '6': 'fake-key 6',
           '7': 'fake-key 7',
           '8': 'fake-key 8',
           '9': 'fake-key 9',
           '0': 'fake-key 0',

           # escape hatch
           '<ctrl-h>': 'set-cmd-text -s :help',
           '<ctrl-g>': ESC_BIND,

           '<ctrl-a>' : 'fake-key <Ctrl-a>',
           '<ctrl-v>': 'insert-text {clipboard}',
           '<ctrl-w>': 'fake-key <Ctrl-c>;;message-info "cut to clipboard"',
           '<alt-w>': 'fake-key <Ctrl-c>;;message-info "copy to clipboard"',
   }

   c.bindings.commands['command'] = {
           '<ctrl-s>': 'search-next',
           '<ctrl-r>': 'search-prev',

           '<ctrl-p>': 'completion-item-focus prev',
           '<ctrl-n>': 'completion-item-focus next',

           '<alt-p>': 'command-history-prev',
           '<alt-n>': 'command-history-next',

           # escape hatch
           '<ctrl-g>': 'mode-leave',
   }

   c.bindings.commands['hint'] = {
           # escape hatch
           '<ctrl-g>': 'mode-leave',
   }


   c.bindings.commands['caret'] = {
           # escape hatch
           '<ctrl-g>': 'mode-leave',
   }


#+end_src


** NanoEmacs

#+begin_src emacs-lisp
                                          ;  (straight-use-package   '(nano :type git :host github :repo "rougier/nano-emacs"))

  (straight-use-package '(nano-theme :type git :host github   :repo "rougier/nano-theme"))

  (load-theme 'nano t)
  (nano-dark)


                                          ; (nano-faces)
                                          ;(nano-theme)

  (load-theme 'nano t)
  (menu-bar-mode -1)
  (tool-bar-mode -1) 

#+end_src

* Reference

This configuration is built around the one provided by David Wilson in his stream [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org][Emacs From Scratch]]

The org-mode configuration comes from different places but most of it comes from [[https://whhone.com/posts/org-mode-task-management/][Wai Hon's Blog]] and from [[https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html][Nicolas Petton's Blog]]. (mostly

The code for the run-or-raise function has been taken from [[https://github.com/tedroden/dot-files/tree/636ee636b472078b6a22b2076eb21b5421f58c9b][Here]].
