init.el

(require 'exwm-randr)

(exwm-randr-enable)

(setq exwm-randr-workspace-monitor-plist '(2 "DP-2"))

(setq exwm-workspace-warp-cursor t)


(defun vinid/update-displays ()
  (vinid/run-in-background "autorandr --change --force")
                                        ;    (message "Display config: %s"
  (string-trim (shell-command-to-string "autorandr --current"))))

(add-hook 'exwm-randr-screen-change-hook #'vinid/update-displays)
(vinid/update-displays)

(defun vinid/run-in-background (command)
   (let ((command-parts (split-string command "[ ]+")))
     (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

(vinid/run-in-background "dropbox start")

(defun vinid/emacs-configuration ()
   (interactive)
   (find-file "~/.emacs.d/emacs_configuration.org"))

 (defun vinid/open-todolist ()
   (interactive)
   (find-file "~/Dropbox/org/orgmode/todos.org"))

(defun vinid/open-inbox ()
   (interactive)
   (find-file "~/Dropbox/org/orgmode/inbox.org"))

(setq clean-buffer-list-delay-special (* 1 3600))
(setq clean-buffer-list-delay-general 1)
(global-set-key (kbd "C-c e b") 'clean-buffer-list)

(global-set-key (kbd "M-?") 'help-command)
(global-set-key (kbd "C-h") 'delete-backward-char)

(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c e c") 'vinid/emacs-configuration)
(global-set-key (kbd "C-c e t") 'vinid/open-todolist)
(global-set-key (kbd "C-c e i") 'vinid/open-inbox)

(use-package 1passel
  :straight '(1passel :host github
                                 :repo "vinid/1passel"
                                 :branch "master"))

(defun gpt-improve()
  (interactive)
    (kill-new (shell-command-to-string
             (concat "python3 /home/vinid/nope/gptask.py --string '" (current-kill 0) "'"))))

  (global-set-key (kbd "C-c g") 'gpt-improve)

;  (straight-use-package   '(nano :type git :host github :repo "rougier/nano-emacs"))

(straight-use-package '(nano-theme :type git :host github   :repo "rougier/nano-theme"))

(load-theme 'nano t)
(nano-dark)
                                        ;  (nano-theme-set-dark)
                                        ; (nano-faces)
                                        ;(nano-theme)

(load-theme 'nano t)
(menu-bar-mode -1)
(tool-bar-mode -1)
